; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-12)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
)
)
)

; plan
1. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 1 of 12
2. (pick ball3 rooma right)
   deleted: (at ball3 rooma) (free right)
   added: (carry ball3 right)
   goals met: 1 of 12
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 1 of 12
4. (drop ball3 roomb right)
   deleted: (carry ball3 right)
   added: (at ball3 roomb) (free right)
   goals met: 2 of 12
5. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 3 of 12
6. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 3 of 12
7. (pick ball12 room4 left)
   deleted: (at ball12 room4) (free left)
   added: (carry ball12 left)
   goals met: 3 of 12
8. (pick ball11 room4 right)
   deleted: (at ball11 room4) (free right)
   added: (carry ball11 right)
   goals met: 3 of 12
9. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 3 of 12
10. (drop ball11 roomb right)
   deleted: (carry ball11 right)
   added: (at ball11 roomb) (free right)
   goals met: 4 of 12
11. (drop ball12 roomb left)
   deleted: (carry ball12 left)
   added: (at ball12 roomb) (free left)
   goals met: 5 of 12
12. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 5 of 12
13. (pick ball10 room4 left)
   deleted: (at ball10 room4) (free left)
   added: (carry ball10 left)
   goals met: 5 of 12
14. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 5 of 12
15. (drop ball10 roomb left)
   deleted: (carry ball10 left)
   added: (at ball10 roomb) (free left)
   goals met: 6 of 12
16. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 6 of 12
17. (pick ball9 room3 left)
   deleted: (at ball9 room3) (free left)
   added: (carry ball9 left)
   goals met: 6 of 12
18. (pick ball8 room3 right)
   deleted: (at ball8 room3) (free right)
   added: (carry ball8 right)
   goals met: 6 of 12
19. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 6 of 12
20. (drop ball8 roomb right)
   deleted: (carry ball8 right)
   added: (at ball8 roomb) (free right)
   goals met: 7 of 12
21. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 8 of 12
22. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 8 of 12
23. (pick ball7 room3 left)
   deleted: (at ball7 room3) (free left)
   added: (carry ball7 left)
   goals met: 8 of 12
24. (pick ball6 room3 right)
   deleted: (at ball6 room3) (free right)
   added: (carry ball6 right)
   goals met: 8 of 12
25. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 8 of 12
26. (drop ball6 roomb right)
   deleted: (carry ball6 right)
   added: (at ball6 roomb) (free right)
   goals met: 9 of 12
27. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 10 of 12
28. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 10 of 12
29. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 10 of 12
30. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 10 of 12
31. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 10 of 12
32. (drop ball2 roomb left)
   deleted: (carry ball2 left)
   added: (at ball2 roomb) (free left)
   goals met: 11 of 12
33. (drop ball1 roomb right)
   deleted: (carry ball1 right)
   added: (at ball1 roomb) (free right)
   goals met: 12 of 12
